<a href="https://colab.research.google.com/github/pathakchiranjit/Capstone_CDF_April21/blob/main/CDF_projects_1004.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Collect data from Google drive:

In [2]:
!pip install -U -q PyDrive

In [3]:
from pydrive.auth import GoogleAuth
from pydrive.drive import GoogleDrive
from google.colab import auth
from oauth2client.client import GoogleCredentials

In [4]:
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [5]:
#XXXXXXX = code you get after your google drive authentication
fileDownloaded = drive.CreateFile({'id':'1Ir3rW0YTKmk7MSjVjCU_UGMQevhe1v9W'})

In [6]:
fileDownloaded.GetContentFile('project_cdf.csv')

In [7]:
import pandas as pd
project_df = pd.read_csv('project_cdf.csv', delimiter=',')
project_df.head()

   event_id     device_id            timestamp  ...   latitude      city       state
0   2765368  2.973348e+18  2016-05-07 22:52:05  ...  28.730140     Delhi       Delhi
1   2955066  4.734221e+18  2016-05-01 20:44:16  ...  22.660325  Calcutta  WestBengal
2    605968 -3.264500e+18  2016-05-02 14:23:04  ...  28.757906     Delhi       Delhi
3    448114  5.731369e+18  2016-05-03 13:21:16  ...  13.153332   Chennai   TamilNadu
4    665740  3.388880e+17  2016-05-06 03:51:05  ...  23.842609    Bokaro   Jharkhand

[5 rows x 7 columns]

### Collect data from MySQL Instances:

In [ ]:
!pip install mysql-connector-python-rf

In [10]:
import mysql.connector
try:
    connection = mysql.connector.connect(host='cpanel.insaid.co',
                                         database='Capstone1',
                                         user='student',
                                         password='student')

    sql_select_Query = "select * from gender_age_train"
    cursor = connection.cursor()
    cursor.execute(sql_select_Query)
    # get all records
    records = cursor.fetchall()
    print("Total number of rows in table: ", cursor.rowcount)
except mysql.connector.Error as e:
    print("Error reading data from MySQL table", e)
finally:
    if connection.is_connected():
        connection.close()
        cursor.close()
        print("MySQL connection is closed")

Total number of rows in table:  74645
MySQL connection is closed

In [11]:
df = pd.DataFrame(records)
df.tail(10)

                         0  1   2       3
74635  1728576663562073800  M  38  M32-38
74636  8116314513428390753  M  25  M23-26
74637 -3539330294838027409  M  25  M23-26
74638  5645813107043557722  F  51    F43+
74639 -4752726726975186730  M  26  M23-26
74640  4682031842235089751  M  30  M29-31
74641 -9178703742877135986  M  30  M29-31
74642   180946546684162312  M  20    M22-
74643  1390702386071991851  M  37  M32-38
74644    89181010588227347  M  25  M23-26

In [12]:
df.reset_index()
df.columns=['device_id', 'gender','age','age_group']
df.head(5)

             device_id gender  age age_group
0 -8076087639492063270      M   35    M32-38
1 -2897161552818060146      M   35    M32-38
2 -8260683887967679142      M   35    M32-38
3 -4938849341048082022      M   30    M29-31
4   245133531816851882      M   30    M29-31

In [13]:
import mysql.connector
try:
    connection = mysql.connector.connect(host='cpanel.insaid.co',
                                         database='Capstone1',
                                         user='student',
                                         password='student')

    sql_select_Query = "select * from phone_brand_device_model"
    cursor = connection.cursor()
    cursor.execute(sql_select_Query)
    # get all records
    records1 = cursor.fetchall()
    print("Total number of rows in table: ", cursor.rowcount)
   
except mysql.connector.Error as e:
    print("Error reading data from MySQL table", e)
finally:
    if connection.is_connected():
        connection.close()
        cursor.close()
        print("MySQL connection is closed")

Total number of rows in table:  87726
MySQL connection is closed

In [14]:
df1 = pd.DataFrame(records1)
df1.tail(10)

                         0     1        2
87716 -2670392286357824533  vivo     X5SL
87717  8855678093786843415    三星    W2014
87718 -6036435451071138878    小米     MI 4
87719 -1242439729152442827    小米      红米2
87720  1174879451292807079    华为  P8 Lite
87721 -4961458925928574032    华为   荣耀畅玩4X
87722 -8819817317449262375    华为      荣耀6
87723 -3358291377416935026    华为    荣耀畅玩4
87724  3282788959750981633    小米     MI 2
87725  2491639413207286271    酷比       M1

In [15]:
df1.reset_index()
df1.columns=['device_id', 'brand','model']
df1.head(5)

             device_id brand    model
0  1877775838486905855  vivo      Y13
1 -3766087376657242966    小米     V183
2 -6238937574958215831  OPPO      R7s
3  8973197758510677470    三星    A368t
4 -2015528097870762664    小米  红米Note2

In [16]:
df1.brand.unique()

array(['vivo', '小米', 'OPPO', '三星', '酷派', '联想 ', '华为', '奇酷', '魅族', '斐讯',
       '中国移动', 'HTC', '天语', '至尊宝', 'LG', '欧博信', '优米', 'ZUK', '努比亚', '惠普',
       '尼比鲁', '美图', '乡米', '摩托罗拉', '梦米', '锤子', '富可视', '乐视', '海信', '百立丰',
       '一加', '语信', '海尔', '酷比', '纽曼', '波导', '朵唯', '聆韵', 'TCL', '酷珀', '爱派尔',
       'LOGO', '青葱', '果米', '华硕', '昂达', '艾优尼', '康佳', '优购', '邦华', '赛博宇华',
       '黑米', 'Lovme', '先锋', 'E派', '神舟', '诺基亚', '普耐尔', '糖葫芦', '亿通', '欧新',
       '米奇', '酷比魔方', '蓝魔', '小杨树', '贝尔丰', '糯米', '米歌', 'E人E本', '西米', '大Q',
       '台电', '飞利浦', '唯米', '大显', '长虹', '维图', '青橙', '本为', '虾米', '夏新', '帷幄',
       '百加', 'SUGAR', '欧奇', '世纪星', '智镁', '欧比', '基伍', '飞秒', '德赛', '易派',
       '谷歌', '金星数码', '广信', '诺亚信', 'MIL', '白米', '大可乐', '宝捷讯', '优语', '首云',
       '瑞米', '瑞高', '沃普丰', '摩乐', '鲜米', '凯利通', '唯比', '欧沃', '丰米', '恒宇丰',
       '奥克斯', '西门子', '欧乐迪', 'PPTV'], dtype=object)

In [17]:
phone={'brand':['vivo', '小米', 'OPPO', '三星', '酷派', '联想 ', '华为', '奇酷', '魅族', '斐讯',
       '中国移动', 'HTC', '天语', '至尊宝', 'LG', '欧博信', '优米', 'ZUK', '努比亚', '惠普',
       '尼比鲁', '美图', '乡米', '摩托罗拉', '梦米', '锤子', '富可视', '乐视', '海信', '百立丰',
       '一加', '语信', '海尔', '酷比', '纽曼', '波导', '朵唯', '聆韵', 'TCL', '酷珀', '爱派尔',
       'LOGO', '青葱', '果米', '华硕', '昂达', '艾优尼', '康佳', '优购', '邦华', '赛博宇华',
       '黑米', 'Lovme', '先锋', 'E派', '神舟', '诺基亚', '普耐尔', '糖葫芦', '亿通', '欧新',
       '米奇', '酷比魔方', '蓝魔', '小杨树', '贝尔丰', '糯米', '米歌', 'E人E本', '西米', '大Q',
       '台电', '飞利浦', '唯米', '大显', '长虹', '维图', '青橙', '本为', '虾米', '夏新', '帷幄',
       '百加', 'SUGAR', '欧奇', '世纪星', '智镁', '欧比', '基伍', '飞秒', '德赛', '易派',
       '谷歌', '金星数码', '广信', '诺亚信', 'MIL', '白米', '大可乐', '宝捷讯', '优语', '首云',
       '瑞米', '瑞高', '沃普丰', '摩乐', '鲜米', '凯利通', '唯比', '欧沃', '丰米', '恒宇丰',
       '奥克斯', '西门子', '欧乐迪', 'PPTV'], 
    'brand_eng':['vivo','Xiaomi','OPPO','Samsung','Coolpad','Lenovo','Huawei','Qiku','Meizu','Phicom',
       'China Mobile','HTC','Tianyu','Extreme Bao','LG','Oberxin','Yumi','ZUK','Nubia','HP',
       'Nibiru','Meitu','Xiangmi','Motorola','Mengmi','Hammer','InFocus','LeTV','Hisense','Bai Li Feng',
       'OnePlus','Yuxin','Haier','Cubbie','Newman','Bird','Dove','Lingyun','TCL','Copper','Aipel ',
       'LOGO','green onion','fruit rice','ASUS','Onda','Aiyouni','Konka','Yougo','Banghua','Cyber ​​Yuhua',
       'Black Rice','Lovme','Pioneer','E School','Shenzhou','Nokia','Pnair','Candy Gourd','Yitong','Ouxin',
       'Mickey','Cubbie Rubik','Blue Devils','Little Poplar','Bairfeng','Nuomi','Mi Song','E People E Book','Simi','Big Q' ,
       'Taipower','Philips','Weimi','Daxian','Changhong','Vitu','Green Orange','Originally','Xia Mi','Amoi','Wei Mi',
       'Bajia','SUGAR','Ouqi','Century Star','Zhimei','Obi','Kivu','Femtosecond','Desai','Yipai',
       'Google','Venus Digital','Guangxin','Noah Xin','MIL','White Rice','Coke','Baojiexun','Youyu','Shouyun',
       'Rimei','Rigao','Wopfung','Mole','Fresh Rice','Kailyton','Weibi','Ouwo','Fengmi','Hengyufeng ',
       'Ox','Siemens','Orlandi','PPTV']}
ph_df=pd.DataFrame.from_dict(phone)
ph_df

    brand    brand_eng
0    vivo         vivo
1      小米       Xiaomi
2    OPPO         OPPO
3      三星      Samsung
4      酷派      Coolpad
..    ...          ...
111   恒宇丰  Hengyufeng
112   奥克斯           Ox
113   西门子      Siemens
114   欧乐迪      Orlandi
115  PPTV         PPTV

[116 rows x 2 columns]

In [18]:
df2=df1.copy()

In [19]:
df2=pd.merge(df2,ph_df,how='left',on='brand')
df2.head(3)

             device_id brand model brand_eng
0  1877775838486905855  vivo   Y13      vivo
1 -3766087376657242966    小米  V183    Xiaomi
2 -6238937574958215831  OPPO   R7s      OPPO

In [20]:
df2['Model']=df2['model']

In [21]:
df2.drop('brand',axis=1,inplace=True)
df2.drop('model',axis=1,inplace=True)

In [22]:
df2.head()

             device_id brand_eng    Model
0  1877775838486905855      vivo      Y13
1 -3766087376657242966    Xiaomi     V183
2 -6238937574958215831      OPPO      R7s
3  8973197758510677470   Samsung    A368t
4 -2015528097870762664    Xiaomi  红米Note2